[
    {
        "title":"Systems Administrative (Sunlab) Consultant",
        "company":"Brown University",
        "location":"Providence, RI",
        "start":"May 2023",
        "end":"Present",
        "description":"I am working as a technical engineer and consultant for the Brown CS Department on responsibilities like orchestrating student setup workflow containers, managing department machines, and empowering network & security protocols. ",
        "image": "/logos/BrownCS.png"
    },
    {
        "title":"Full Stack Software Engineer Intern",
        "company":"Fidelity Investments",
        "location":"Smithfield, RI",
        "start":"June 2023",
        "end":"August 2023",
        "description":"I worked on an agile development team to migrate Fidelity Institutional's JSP-based website to Angular with Sitecore as a CMS, contributing signficantly to ETF bricklet design, API development, Jenkins & Terraform CI/CD pipelines, cloud architecture, and unit/integration testing. During this internship, I also took rotational roles to learn about SwiftUI blockchain app development in Fidelity Labs (Fidelity's startup incubator) as well as quantitative equity trading and UI/UX platform design with Fidelity Capital Markets (Fidelity's innovative trading arm).",
        "image": "/logos/Fidelity.png"
    },
    {
        "title":"UX Product Design Solutions Lead",
        "company":"Jara Unit",
        "location":"Stanford, CA",
        "start":"April 2023",
        "end":"August 2023",
        "description":"I worked directly with the CEO Soraya Fouladi on designing and engineering a new user interface for the nonprofit startup's portable global electronic learning device. I contributed on cultural sensitivity, demographic analysis, color-blind awareness, feature scoping, Figma wireframing, data architecture, agile project management, and React development.",
        "image": "/logos/Jara.png"
    },
    {
        "title":"Software Engineer Intern",
        "company":"Thermo Fisher Scientific",
        "location":"Tewksbury, MA",
        "start":"May 2022",
        "end":"August 2022",
        "description":"I mentored junior software engineer interns in Agile & Scrum methodologies, testing frameworks, and project presentation. In addition, I worked on a devops team on a software data visualization solution for a Raman Spectrometer chemical instrument device, contributing with launching AWS cloud resources, configuring Github Actions CI/CD pipelines, and designing a unit/manual testing framework using Model XML/SPC chemical simulations.",
        "image": "/logos/ThermoFisher.png"
    },
    {
        "title": "Full Stack Developer",
        "company": "Full Stack at Brown",
        "location": "Providence, RI",
        "start": "February 2022",
        "end": "May 2023",
        "description": "As a developer for this student organization, I contributed to projects like Ghana Health Services Home Visits React Native mobile app for the government agency as well as other meaningful projects like Brown CS Hours TA queue, Zafra literary journal, and The Critical Review (the go-to student course shopping resource at Brown with professor ratings, average & max weekly hours, and course descriptions).",
        "image": "/logos/FSAB.png"
    },
    {
        "title":"Software Development Intern",
        "company":"Thermo Fisher Scientific",
        "location":"Franklin, MA",
        "start":"July 2021",
        "end":"August 2021",
        "description":"I designed and built a frontend responsive scheduling interface from scratch for the AerosolSense Sampler (an in-air COVID/pathogen detector) using BootstrapUI framework and used a BeagleBone, C++, and electrical circuits to integrate the machine's hardware components with its scheduling microservice. I also streamlined the Agile development onboarding workflow by upgrading SourceTree, Confluence, and Jira documentation accordingly.",
        "image": "/logos/ThermoFisher.png"
    }
]